micropython/micropython/ports/raspberrypi/boards/pimoroni_tiny2040/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Pimoroni Tiny 2040"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_LED_R (&pin_GPIO18)
#define MICROPY_HW_LED_G (&pin_GPIO19)
#define MICROPY_HW_LED_B (&pin_GPIO20)

#define MICROPY_HW_USER_SW (&pin_GPIO23)

#define TOTAL_FLASH_SIZE (8 * 1024 * 1024)

// These pins are unconnected
#define IGNORE_PIN_GPIO8    1
#define IGNORE_PIN_GPIO9    1
#define IGNORE_PIN_GPIO10   1
#define IGNORE_PIN_GPIO11   1
#define IGNORE_PIN_GPIO12   1
#define IGNORE_PIN_GPIO13   1
#define IGNORE_PIN_GPIO14   1
#define IGNORE_PIN_GPIO15   1
#define IGNORE_PIN_GPIO16   1
#define IGNORE_PIN_GPIO17   1
#define IGNORE_PIN_GPIO21   1
#define IGNORE_PIN_GPIO22   1
#define IGNORE_PIN_GPIO24   1
#define IGNORE_PIN_GPIO25   1
